In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.Series([2,3,643,23])

0      2
1      3
2    643
3     23
dtype: int64

In [3]:
pd.Series([2,3,643,23],name = 'random series hai ye',dtype = np.int16)

0      2
1      3
2    643
3     23
Name: random series hai ye, dtype: int16

In [4]:
him = pd.Series({"marks":23,"name": "Himanshu Sharma","roll no": 448})
him

marks                   23
name       Himanshu Sharma
roll no                448
dtype: object

In [5]:
marks = pd.Series([22,534,234,252],index = ['ram','shyam','karan','rohan'],name = 'baccho ke marks')
marks

ram       22
shyam    534
karan    234
rohan    252
Name: baccho ke marks, dtype: int64

In [6]:
pd.Series([22,534,234,252],['ram','shyam','karan','rohan'])

ram       22
shyam    534
karan    234
rohan    252
dtype: int64

In [7]:
him.dtype

dtype('O')

In [8]:
marks.dtype

dtype('int64')

In [9]:
him.size

3

In [10]:
marks.size

4

In [11]:
him.name

In [12]:
marks.name

'baccho ke marks'

In [13]:
him.index

Index(['marks', 'name', 'roll no'], dtype='object')

In [14]:
him.values

array([23, 'Himanshu Sharma', 448], dtype=object)

In [15]:
marks.values

array([ 22, 534, 234, 252])

In [16]:
marks.index

Index(['ram', 'shyam', 'karan', 'rohan'], dtype='object')

In [17]:
marks.is_unique

True

In [18]:
him.is_unique

True

In [19]:
him

marks                   23
name       Himanshu Sharma
roll no                448
dtype: object

In [20]:
marks

ram       22
shyam    534
karan    234
rohan    252
Name: baccho ke marks, dtype: int64

In [21]:
him[0] = 448

C:\Users\DELL\AppData\Local\Temp\ipykernel_16932\441781005.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  him[0] = 448

In [22]:
him

marks                  448
name       Himanshu Sharma
roll no                448
dtype: object

In [23]:
him.is_unique

False

In [26]:
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 6, 7, 8]
})

# Drop rows with any NaN values
df_no_na = df.dropna(axis=0, how='any')
print(df_no_na)

     A    B
1  2.0  6.0
3  4.0  8.0

In [32]:
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 6, 7, 8]
})

In [33]:
df

     A    B
0  1.0  NaN
1  2.0  6.0
2  NaN  7.0
3  4.0  8.0

In [34]:
# Drop columns with any NaN values
df_no_na_col = df.dropna(axis=1, how='any')
print(df_no_na_col)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [35]:
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 6, 7, 8]
})

# Fill NaN values with 0
df_filled = df.fillna(0)
print(df_filled)

     A    B
0  1.0  0.0
1  2.0  6.0
2  0.0  7.0
3  4.0  8.0

In [36]:
df = pd.DataFrame({
    'A': [1, 2, None, 4],
    'B': [None, 6, 7, 8]
})

In [37]:
df

     A    B
0  1.0  NaN
1  2.0  6.0
2  NaN  7.0
3  4.0  8.0

In [38]:
df.fillna(method='ffill')

C:\Users\DELL\AppData\Local\Temp\ipykernel_16932\989150317.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A    B
0  1.0  NaN
1  2.0  6.0
2  2.0  7.0
3  4.0  8.0

In [39]:
df

     A    B
0  1.0  NaN
1  2.0  6.0
2  NaN  7.0
3  4.0  8.0

In [42]:
df.ffill()

     A    B
0  1.0  NaN
1  2.0  6.0
2  2.0  7.0
3  4.0  8.0

In [43]:
df

     A    B
0  1.0  NaN
1  2.0  6.0
2  NaN  7.0
3  4.0  8.0

In [44]:
df.bfill()

     A    B
0  1.0  6.0
1  2.0  6.0
2  4.0  7.0
3  4.0  8.0

In [45]:
df.fillna(method = 'bfill')

C:\Users\DELL\AppData\Local\Temp\ipykernel_16932\3673297803.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill')

     A    B
0  1.0  6.0
1  2.0  6.0
2  4.0  7.0
3  4.0  8.0